"""
AtCorder.ABC.440.G の Docstring
問題文
ハロウィンの季節がやってきました。あなたは肝試しとして、お化け屋敷に挑戦しようとしています。

F 階だてのお化け屋敷があり、各階は H 行 W 列のグリッドで表されます。k 階を表すグリッドの上から i 行目・左から j 列目のマスをマス (k,i,j) とします。

マス (k,i,j) の内容は文字 S 
k,i,j
​	
  によって、以下のように表されます。

S 
k,i,j
​	
  が数字 (0 - 9) の場合、マス (k,i,j) は空きマスであり、数字が表す 1 桁の整数と同じ枚数のコインがある。
S 
k,i,j
​	
  が # の場合、マス (k,i,j) は壁マスである。
空きマス (k,i,j) からほかのマス (k 
′
 ,i 
′
 ,j 
′
 ) に直接移動できる条件は、マス (k 
′
 ,i 
′
 ,j 
′
 ) が空きマスであり、かつ以下のいずれかを満たすことです。

k 
′
 =k および ∣i 
′
 −i∣+∣j 
′
 −j∣=1 を満たす。
(k 
′
 ,i 
′
 ,j 
′
 )=(k+1,i,j) を満たす。
(k 
′
 ,i 
′
 ,j 
′
 )=(k−1,i,j) を満たし、かつマス (k,i,j) にハシゴが置かれている。
グリッドの外部に移動することはできません。

Q 個の質問が与えられるので、それぞれの答えを求めてください。i 個目の質問 (1≤i≤Q) は以下の通りです。

好きな空きマスを 1 つだけ選んでハシゴを置いてから、マス (G 
i
​	
 ,A 
i
​	
 ,B 
i
​	
 ) を開始地点として移動を繰り返したとき、訪れたマスにあるコインの合計枚数の最大値を求めよ。
なお、各質問は独立です。つまり、ある質問で置いたハシゴは、ほかの質問に影響を与えません。

制約
F,H,W は整数
1≤F≤10
1≤H,W≤500
S 
k,i,j
​	
  は数字 (0, 1, 2, 3, 4, 5, 6, 7, 8, 9) または # のいずれか (1≤k≤F,1≤i≤H,1≤j≤W)
Q は整数
1≤Q≤10 
5
 
G 
i
​	
 ,A 
i
​	
 ,B 
i
​	
  は整数 (1≤i≤Q)
1≤G 
i
​	
 ≤F (1≤i≤Q)
1≤A 
i
​	
 ≤H (1≤i≤Q)
1≤B 
i
​	
 ≤W (1≤i≤Q)
S 
G 
i
​	
 ,A 
i
​	
 ,B 
i
​	
 
​	
  は # でない (1≤i≤Q)
入力
入力は以下の形式で標準入力から与えられる。

F H W
S 
1,1,1
​	
 S 
1,1,2
​	
 ⋯S 
1,1,W
​	
 
S 
1,2,1
​	
 S 
1,2,2
​	
 ⋯S 
1,2,W
​	
 
⋮
S 
1,H,1
​	
 S 
1,H,2
​	
 ⋯S 
1,H,W
​	
 
S 
2,1,1
​	
 S 
2,1,2
​	
 ⋯S 
2,1,W
​	
 
S 
2,2,1
​	
 S 
2,2,2
​	
 ⋯S 
2,2,W
​	
 
⋮
S 
2,H,1
​	
 S 
2,H,2
​	
 ⋯S 
2,H,W
​	
 
⋮
S 
F,1,1
​	
 S 
F,1,2
​	
 ⋯S 
F,1,W
​	
 
S 
F,2,1
​	
 S 
F,2,2
​	
 ⋯S 
F,2,W
​	
 
⋮
S 
F,H,1
​	
 S 
F,H,2
​	
 ⋯S 
F,H,W
​	
 
Q
G 
1
​	
  A 
1
​	
  B 
1
​	
 
G 
2
​	
  A 
2
​	
  B 
2
​	
 
⋮
G 
Q
​	
  A 
Q
​	
  B 
Q
​	
 
出力
Q 行出力せよ。i 行目 (1≤i≤Q) には i 個目の質問の答えを出力せよ。

入力例 1
Copy
3 5 6
######
##5###
#1#11#
#1#11#
######
######
##313#
#4##1#
#242##
######
######
#0####
##4###
###99#
######
3
1 2 3
2 3 2
3 2 2
出力例 1
Copy
47
34
0
1 番目の質問において、マス (2,3,5) にハシゴを置いた状態で以下のように移動することで、訪れたマスにあるコインの合計枚数を 47 にすることができます。

お化け屋敷の 1 階において、マス (1,2,3) から開始する。
お化け屋敷の 2 階に上がり、マス (2,2,3)→(2,2,4)→(2,2,5)→(2,3,5) の順に移動する。
お化け屋敷の 1 階に降りて、マス (1,3,5)→(1,4,5)→(1,4,4)→(1,3,4)→(1,4,4) の順に移動する。
お化け屋敷の 2 階に上がり、マス (2,4,4)→(2,4,3)→(2,4,2)→(2,3,2)→(2,4,2)→(2,4,3)→(2,4,4) の順に移動する。
お化け屋敷の 3 階に上がり、マス (3,4,4)→(3,4,5) の順に移動する。
2 番目の質問において、マス (2,4,4) にハシゴを置いた状態で以下のように移動することで、訪れたマスにあるコインの合計枚数を 34 にすることができます。

お化け屋敷の 2 階において、マス (2,3,2)→(2,4,2)→(2,4,3)→(2,4,4) の順に移動する。
お化け屋敷の 1 階に降りて、マス (1,4,4)→(1,4,5)→(1,3,5)→(1,3,4)→(1,4,4) の順に移動する。
お化け屋敷の 2 階に上がり、マス (2,4,4) にいる。
お化け屋敷の 3 階に上がり、マス (3,4,4)→(3,4,5) の順に移動する。
3 番目の質問において、どのようにハシゴを置いても開始地点のマス (3,2,2) から移動することはできません。

入力例 2
Copy
3 6 30
31#990#7###71298#6#9####3##04#
###66###6######7#4#3#1079239#6
891###8#73#7#5838#589#225#1282
#####5#306#9#38#50##6#71##8658
6#68#4#5###30###3#5716987#####
06#8####3#####134#5##2##28#169
#5#11####0#75#8######28#6#904#
85#71####0##9#7#0##8#2##00####
#1#09#3772#838#67#6##261###0#4
#4##78###7#########9#9#488##08
43#1##4632##46714436##849#77#6
8#83#61##4#14476#9#1##72#3####
5#99####52##6#9####9#4#4132#3#
##910#27529#69##491###0#06#9##
0#60845#02##28##610#2####25#6#
#229156374##47#30907#60#####28
#0#810#54###21##1#3###8#5917##
###6#56#60##04#73###6255###2##
10
3 4 23
3 2 4
1 4 14
2 3 12
1 1 16
1 2 9
3 5 6
1 3 19
2 2 4
3 4 9
出力例 2
Copy
136
217
474
255
474
285
217
451
251
217
"""